<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"8ed0e6581554f11ce3c929a7fb2656536cc844efd8268d80b9198d018caf746e","plan_job_ref":"Job Test terraform-refresh #70 at https://github.com/dflook/terraform-github-actions/actions/runs/16830246761","plan_out_hash":"f06522562f71b59fef4b192dda199c71d22633bf014c663a50077367e3b6727f","plan_hash":"21e8422f5377b7ca546585a4a1869d40e9cad95a4d6dde0103083718d97a92a8","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-refresh__
:recycle: Skipping refresh of resource state
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.one will be created
+   resource "local_file" "one" {
+       content              = "this is my first file"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "test"
+       id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Test terraform-refresh #70](https://github.com/dflook/terraform-github-actions/actions/runs/16830246761)